vacations/src/Documents/МС_ЗаявкаНаОтпуск/МС_ЗаявкаНаОтпуск.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МС_ЗаявкаНаОтпуск</name>
  <registerRecords>InformationRegister.МС_ГрафикОтпусков</registerRecords>
  <attributes>
    <name>Вид</name>
    <type>
      <types>EnumRef.МС_ВидыОтпусков</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.МС_СтатусыЗаявкиНаОтпуск</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Длительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

vacations/src/InformationRegisters/МС_УровеньДоступаКЗаявкамНаОтпуск/МС_УровеньДоступаКЗаявкамНаОтпуск.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МС_УровеньДоступаКЗаявкамНаОтпуск</name>
  <resources>
    <name>ИмеетПравоНаСогласование</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИмеетПравоНаУтверждение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИмеетПравоНаВыполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИмеетПравоНаОтмену</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

vacations/src/InformationRegisters/МС_ОстаткиОтпусков/МС_ОстаткиОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МС_ОстаткиОтпусков</name>
  <informationRegisterPeriodicity>Year</informationRegisterPeriodicity>
  <resources>
    <name>КоличествоДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

vacations/src/InformationRegisters/МС_ГрафикОтпусков/МС_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МС_ГрафикОтпусков</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.МС_СтатусыЗаявкиНаОтпуск</types>
    </type>
  </resources>
  <resources>
    <name>ВидОтпуска</name>
    <type>
      <types>EnumRef.МС_ВидыОтпусков</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДеньПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

vacations/src/Enums/МС_СтатусыЗаявкиНаОтпуск/МС_СтатусыЗаявкиНаОтпуск.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МС_СтатусыЗаявкиНаОтпуск</name>
  <enumValues>
    <name>Заявка</name>
  </enumValues>
  <enumValues>
    <name>Согласована</name>
  </enumValues>
  <enumValues>
    <name>Утверждена</name>
  </enumValues>
  <enumValues>
    <name>Выполнена</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
</mdclass:Enum>

vacations/src/Documents/МС_ЗаявкаНаОтпуск/Forms/ФормаДокумента/Module.bsl
#Область ПеременныеМодуля

#КонецОбласти

#Область СлужебныеПроцедуры

#КонецОбласти

#Область ПроцедурыОбщегоНазначения 

&НаКлиенте
Процедура РассчитатьДлительность()
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаНачала)
		ИЛИ НЕ ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		
		Объект.Длительность = 0;
		Возврат;
	КонецЕсли;

	чСекунд = (КонецДня(Объект.ДатаОкончания) - НачалоДня(Объект.ДатаНачала)) + 1;
	Объект.Длительность = чСекунд / (24*60*60);
	
	Рез = ПолучитьИнформативныеОстатки();
	ЗаполнитьИнформативныеОстатки(Рез);

КонецПроцедуры // РассчитатьДлительность()

&НаСервере
Процедура ЗаполнитьИнформативныеОстатки(Структ)

	ОстатокНаНачалоПериода 	= Структ.ОстатокНаНачалоПериода;
	ОстатокНаКонецПериода 	= Структ.ОстатокНаКонецПериода;

КонецПроцедуры // ЗаполнитьИнформативныеОстатки()

&НаСервере
Процедура ЗаполнитьСписокДоступныхСтатусов()
	
	Если Пользователи.РолиДоступны("МС_ИзменениеЗаявокНаОтпуск")
		ИЛИ Пользователи.ЭтоПолноправныйПользователь() Тогда
		
		СписокДоступныхСтатусов.Очистить();
		СписокДоступныхСтатусов.Добавить(Перечисления.МС_СтатусыЗаявкиНаОтпуск.Заявка);
		СписокДоступныхСтатусов.Добавить(Перечисления.МС_СтатусыЗаявкиНаОтпуск.Согласована);
		СписокДоступныхСтатусов.Добавить(Перечисления.МС_СтатусыЗаявкиНаОтпуск.Утверждена);
		СписокДоступныхСтатусов.Добавить(Перечисления.МС_СтатусыЗаявкиНаОтпуск.Выполнена);
		СписокДоступныхСтатусов.Добавить(Перечисления.МС_СтатусыЗаявкиНаОтпуск.Отменена);
		
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РС.Пользователь КАК Пользователь,
	|	РС.ИмеетПравоНаСогласование КАК ИмеетПравоНаСогласование,
	|	РС.ИмеетПравоНаУтверждение КАК ИмеетПравоНаУтверждение,
	|	РС.ИмеетПравоНаОтмену КАК ИмеетПравоНаОтмену,
	|	РС.ИмеетПравоНаВыполнение КАК ИмеетПравоНаВыполнение
	|ИЗ
	|	РегистрСведений.МС_УровеньДоступаКЗаявкамНаОтпуск КАК РС
	|ГДЕ
	|	РС.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	
	СписокДоступныхСтатусов.Очистить();
	СписокДоступныхСтатусов.Добавить(Перечисления.МС_СтатусыЗаявкиНаОтпуск.Заявка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.ИмеетПравоНаСогласование Тогда
			СписокДоступныхСтатусов.Добавить(Перечисления.МС_СтатусыЗаявкиНаОтпуск.Согласована);
		КонецЕсли;
		Если Выборка.ИмеетПравоНаУтверждение Тогда
			СписокДоступныхСтатусов.Добавить(Перечисления.МС_СтатусыЗаявкиНаОтпуск.Утверждена);
		КонецЕсли;
		Если Выборка.ИмеетПравоНаВыполнение Тогда
			СписокДоступныхСтатусов.Добавить(Перечисления.МС_СтатусыЗаявкиНаОтпуск.Выполнена);
		КонецЕсли;
		Если Выборка.ИмеетПравоНаОтмену Тогда
			СписокДоступныхСтатусов.Добавить(Перечисления.МС_СтатусыЗаявкиНаОтпуск.Отменена);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры // ЗаполнитьСписокДоступныхСтатусов()

&НаСервере
Функция ПолучитьИнформативныеОстатки()
	
	СтруктураВозврата = Новый Структура("ОстатокНаНачалоПериода,ОстатокНаКонецПериода", 0, 0);
	
	Если Не ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РС.Сотрудник КАК Сотрудник,
	|	РС.КоличествоДней КАК КоличествоДней
	|ПОМЕСТИТЬ ВТ_НаНачалоГода
	|ИЗ
	|	РегистрСведений.МС_ОстаткиОтпусков.СрезПоследних(&НачГода, Сотрудник = &Сотрудник) КАК РС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Сотрудник КАК Сотрудник,
	|	СУММА(Т.КолвоДней) КАК КолвоДней
	|ПОМЕСТИТЬ ВТ_Потрачено
	|ИЗ
	|	(ВЫБРАТЬ
	|		МС_ГрафикОтпусковСрезПоследних.Сотрудник КАК Сотрудник,
	|		МС_ГрафикОтпусковСрезПоследних.ДеньПериода КАК ДеньПериода,
	|		1 КАК КолвоДней
	|	ИЗ
	|		РегистрСведений.МС_ГрафикОтпусков.СрезПоследних(, Сотрудник = &Сотрудник) КАК МС_ГрафикОтпусковСрезПоследних
	|	ГДЕ
	|		НЕ МС_ГрафикОтпусковСрезПоследних.Статус = &СтатусОтменено
	|		И МС_ГрафикОтпусковСрезПоследних.ДеньПериода МЕЖДУ &НачГода И &ДатаДок) КАК Т
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т1.Сотрудник КАК Сотрудник,
	|	СУММА(Т1.НачОст) КАК НачОст,
	|	СУММА(Т1.Потрачено) КАК Потрачено
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_НаНачалоГода.Сотрудник КАК Сотрудник,
	|		ВТ_НаНачалоГода.КоличествоДней КАК НачОст,
	|		0 КАК Потрачено
	|	ИЗ
	|		ВТ_НаНачалоГода КАК ВТ_НаНачалоГода
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТ_Потрачено.Сотрудник,
	|		0,
	|		ВТ_Потрачено.КолвоДней
	|	ИЗ
	|		ВТ_Потрачено КАК ВТ_Потрачено) КАК Т1
	|
	|СГРУППИРОВАТЬ ПО
	|	Т1.Сотрудник";
	
	Запрос.УстановитьПараметр("НачГода", 		КонецДня(НачалоГода(Объект.ДатаНачала)));
	Запрос.УстановитьПараметр("Сотрудник", 		Объект.Сотрудник);
	Запрос.УстановитьПараметр("СтатусОтменено", Перечисления.МС_СтатусыЗаявкиНаОтпуск.Отменена);
	Запрос.УстановитьПараметр("ДатаДок", 		КонецДня(НачалоДня(Объект.ДатаНачала)-100));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СтруктураВозврата.ОстатокНаНачалоПериода = Выборка.НачОст - Выборка.Потрачено + ПоложенноеКолвоДнейОтпуска(Объект.ДатаНачала);
	КонецЕсли;
	
	СтруктураВозврата.Вставить("ОстатокНаКонецПериода", СтруктураВозврата.ОстатокНаНачалоПериода - ЧислоДней(Объект.ДатаНачала, Объект.ДатаОкончания));
	
	Возврат СтруктураВозврата;

КонецФункции // ПолучитьИнформативныеОстатки()

&НаСервереБезКонтекста
Функция ПоложенноеКолвоДнейОтпуска(ДатаНачалаОтпуска)
	
	ДнейОтпускаВМесяц = 2.33;
	Мес = Месяц(ДатаНачалаОтпуска) - 1;
	Колво = ДнейОтпускаВМесяц * Мес;
	
	ЧислоДней = День(ДатаНачалаОтпуска);
	Если ЧислоДней > 1 Тогда
		КонДень = День(КонецМесяца(ДатаНачалаОтпуска));
		Колво = Колво + Окр(ДнейОтпускаВМесяц * ЧислоДней / КонДень, 2);
	КонецЕсли;
	
	Возврат Колво;

КонецФункции // ПоложенноеКолвоДнейОтпуска()

&НаСервереБезКонтекста
Функция ЧислоДней(НачДата, КонДата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Т.НачДата КАК НачДата,
	|	Т.КонДата КАК КонДата,
	|	РАЗНОСТЬДАТ(Т.НачДата, Т.КонДата, ДЕНЬ) КАК КолвоДней
	|ИЗ
	|	(ВЫБРАТЬ
	|		&НачДата КАК НачДата,
	|		&КонДата КАК КонДата) КАК Т";
	
	Запрос.УстановитьПараметр("НачДата", НачДата);
	Запрос.УстановитьПараметр("КонДата", КонДата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Рез = 0;
	Если Выборка.Следующий() Тогда
		Рез = Выборка.КолвоДней+1;
	КонецЕсли;
	
	Возврат Рез;

КонецФункции // ЧислоДней()

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьСписокДоступныхСтатусов();
	
	Если СписокДоступныхСтатусов.НайтиПоЗначению(Объект.Статус) = Неопределено Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Рез = ПолучитьИнформативныеОстатки();
	ЗаполнитьИнформативныеОстатки(Рез);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	БылСтатус = Объект.Статус;
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандныхПанелейФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	РассчитатьДлительность();
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	РассчитатьДлительность();
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	
	Если СписокДоступныхСтатусов.НайтиПоЗначению(Объект.Статус) = Неопределено Тогда
		ПоказатьПредупреждение(,"Нет прав доступа на установку этого статуса");
		Объект.Статус = БылСтатус;
	КонецЕсли;
	
	БылСтатус = Объект.Статус;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)

	Рез = ПолучитьИнформативныеОстатки();
	ЗаполнитьИнформативныеОстатки(Рез);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("МС_ИзменениеЗаявкиНаОтпуск");
	
КонецПроцедуры

#КонецОбласти

#Область ОператорыОсновнойПрограммы

#КонецОбласти
